---
kind: other
id: Methods.T:Autodesk.Revit.DB.DimensionSegment
source: html/47a61bdf-265c-ba03-fded-519faae56ec7.htm
---
# DimensionSegment Methods

Causes the object to release immediately any resources it may be utilizing.